---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewUnderlayOrientation
source: html/dc3cb099-6612-c4dc-4d5b-515e896547e9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewUnderlayOrientation Property

"Underlay Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewUnderlayOrientation { get; }
```